shl-emacs.org
#+title: Emacs Configuration of Sebastian Hempel Linde
#+author: Sebastian Hempel Linde
#+email: sebastian@hempellinde.com
#+langauge: en
#+options: ':t toc:nil num:t author:t email:t
#+startup: content indent
#+macro: latest-export-date (eval (format-time-string "%F %T %z"))

#+begin_src emacs-lisp
(eval (format-time-string "%F %T %z"))
#+end_src

#+RESULTS:
: 2024-10-31 08:17:21 +0100

* Details of Emacs Build

I build Emacs from source, to ensure that I am having access to the most recent developments.
To build Emacs I rely on the following settings:

#+begin_src emacs-lisp :exports both
system-configuration-options
#+end_src

#+RESULTS:
: --with-native-compilation=aot --with-x --with-tree-sitter --with-wide-int --with-xft --with-gnutls --with-mailutils --without-pop --with-cairo --with-imagemagick

I build Emacs in the following way:

#+begin_src bash
  cd $EMACS_GIT_DIR
  BUILD_OPTS=$(emacs \
                   --batch \
                   --eval "(prin1 system-configuration-options)")

  ./autogen.sh
  echo "$BUILD_OPTS" | sed 's/^"\(.*\)"$/\1/' \
      | xargs ./configure
  make bootstrap
  sudo make install
#+end_src

#+toc: headlines 8 insert TOC here, with eight headline levels
ææææ

* Anatomy of my Emacs configuration

My Emacs configuration is split into several parts:
+ The standard ~early-init.el~ :: Containing startup optimizations and UI disabling.
+ The standard ~init.el~ :: Currently containing most of the configuration

* Early Initialization ~early-init.el~

** Setup function to determine which system we are running on

#+begin_src emacs-lisp :tangle "early-init.el"
(defvar shl-is-wsl
  (when (string-match "-[Mm]icrosoft" operating-system-release)
    t)
  "Is Emacs running in WSL?")

(defvar shl-is-tiling-wm
  (when (and (getenv "DESKTOP_SESSION") (string-match "river" (getenv "DESKTOP_SESSION")))
    t)
  "Is Emacs running in a tiling window manager")
#+end_src

** Basic frame settings and UI disabling

#+begin_src emacs-lisp :tangle "early-init.el"
(setq frame-resize-pixelwise t
      frame-inhibit-implied-resize t
      ring-bell-function 'ignore
      use-dialog-box nil
      use-file-dialog nil
      use-short-answers t
      inhibit-splash-screen t
      inhibit-startup-screen t
      inhibit-x-resources t
      inhibit-startup-echo-area-message user-login-name
      inhibit-startup-buffer-menu t)

;; Disable unwanted UI elements
(dolist (mode '(tool-bar-mode scroll-bar-mode 
			      horizontal-scroll-bar-mode menu-bar-mode))
  (when (fboundp mode)
    (funcall mode -1)))

;; When running in a tiling wm I don't want decorations
(when shl-is-tiling-wm
  (setq default-frame-alist '((undecorated . t))))
#+end_src

** Optimize startup time

#+begin_src emacs-lisp :tangle "early-init.el"
;; Increase garbage collection threshold while loading Emacs.
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.5)


;; Speed up startup time - but save the values for after Emacs
;; is started.
(defvar shl--file-name-handler-alist file-name-handler-alist)
(defvar shl--vc-handled-backends vc-handled-backends)

(setq file-name-handler-alist nil
      vc-handled-backends nil)

(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 1000 1000 8)
                  gc-cons-percentage 0.1
                  file-name-handler-alist shl--file-name-handler-alist
                  vc-handled-backends shl--vc-handled-backends)))
#+end_src

* Configuration Initialization ~init.el~
** Setup load path

#+begin_src emacs-lisp :tangle "init.el"
(mapc
 (lambda (string)
   (add-to-list 'load-path (locate-user-emacs-file string)))
 '("shl-lisp" "shl-modules"))
#+end_src

** Load custom lisp

#+begin_src emacs-lisp :tangle "init.el"
(require 'shl-core)
#+end_src

** Load modules

#+begin_src emacs-lisp :tangle "init.el"
(require 'shl-appearance)
(require 'shl-essentials)
(require 'shl-completion)
(require 'shl-development)
(require 'shl-org)
#+end_src

* SHL Custom Lisp

In this section I set up the core variables, functions and macros needed for my system.

#+begin_src emacs-lisp :tangle "shl-lisp/shl-core.el" :mkdirp yes
;;; init.el --- Emacs Configuration of Sebastian Hempel Linde -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:

(defvar shl--package-contents-refreshed nil)

(defun shl--package-refresh-contents-once ()
  "Refresh the contents of the package cache.
Should only be done once when starting Emacs."
  (when (not shl--package-contents-refreshed)
    (setq shl--package-contents-refreshed t)
    (package-refresh-contents)))

(defvar shl--missing-packages
  "Packages not able to install")

(defmacro shl-pkg-config (name &rest config)
  "Install NAME package and evaluate the CONFIG if
package install is successful."
  (declare (indent 1))
  `(if (not (package-installed-p ,name))
       (condition-case err
	   (progn (shl--package-refresh-contents-once)
		  (package-install ,name))
	 (error
	  (message "Couldn't install optional package `%s': %S" ,name err)
	  (push ,name shl--missing-packages)))
     ,@config))

(defmacro shl-bind-key (keymap &rest definitions)
  "Expand key binding DEFINITIONS for the given KEYMAP.
DEFINITIONS is a sequence of string and command pairs."
  (declare (indent 1))
  (unless (zerop (% (length definitions) 2))
    (error "Uneven number of key+command pairs."))
  (let ((keys (seq-filter #'stringp definitions))
        (commands (seq-remove #'stringp definitions)))
    `(when-let* (((keymapp ,keymap))
                 (map ,keymap))
       ,@(mapcar
          (lambda (pair)
            (let* ((key (car pair))
                   (command (cdr pair)))
              (unless (and (null key) (null command))
                `(define-key map (kbd ,key) ,command))))
          (cl-mapcar #'cons keys commands)))))

(require 'cl-lib)
(defun shl-git-clone-clipboard-url ()
  "Clone git URL in clipboard asynchronously and open in dired when finished."
  (interactive)
  (cl-assert (string-match-p "^\\(http\\|https\\|ssh\\)://" (current-kill 0)) nil "No URL in clipboard")
  (let* ((url (current-kill 0))
         (download-dir (expand-file-name "~/data/resources/code-reference/"))
         (project-dir (concat (file-name-as-directory download-dir)
                              (file-name-base url)))
         (default-directory download-dir)
         (command (format "git clone %s" url))
         (buffer (generate-new-buffer (format "*%s*" command)))
         (proc))
    (when (file-exists-p project-dir)
      (if (y-or-n-p (format "%s exists. delete?" (file-name-base url)))
          (delete-directory project-dir t)
        (user-error "Bailed")))
    (switch-to-buffer buffer)
    (setq proc (start-process-shell-command (nth 0 (split-string command)) buffer command))
    (with-current-buffer buffer
      (setq default-directory download-dir)
      (shell-command-save-pos-or-erase)
      (require 'shell)
      (shell-mode)
      (view-mode +1))
    (set-process-sentinel proc (lambda (process state)
                                 (let ((output (with-current-buffer (process-buffer process)
                                                 (buffer-string))))
                                   (kill-buffer (process-buffer process))
                                   (if (= (process-exit-status process) 0)
                                       (progn
                                         (message "finished: %s" command)
                                         (dired project-dir))
                                     (user-error (format "%s\n%s" command output))))))
    (set-process-filter proc #'comint-output-filter)))

(provide 'shl-core)
#+end_src

* Modules
** Appearance

Here we set up the appearance of the editor.
Using Prot's ~modus-themes~ and his ~fontaine~ package for font management.

*** Font

#+begin_src emacs-lisp :tangle "shl-modules/shl-appearance.el" :mkdirp yes
(shl-pkg-config 'fontaine
  (add-hook 'after-init-hook #'fontaine-mode)
  (add-hook 'after-init-hook (lambda ()
			      (fontaine-set-preset 'regular-dark)))
   (setopt x-underline-at-descent-line nil)
   (setq fontaine-presets
         '((small
            :default-family "Iosevka Comfy Motion"
            :default-height 80
            :variable-pitch-family "Iosevka Comfy Duo")
           (regular-dark
            :default-family "Iosevka Comfy"
            :variable-pitch-family "Iosevka Comfy Duo"
            :default-weight medium) ; like this it uses all the fallback values and is named `regular'
           (regular-light 
            :default-weight semilight) ; like this it uses all the fallback values and is named `regular'
           (medium-light
            :default-weight semilight
            :default-height 115)
           (medium-dark
            :default-weight medium
            :default-height 115
            :bold-weight extrabold))))
#+end_src

*** Theme

#+begin_src emacs-lisp :tangle "shl-modules/shl-appearance.el" :mkdirp yes
(shl-pkg-config 'modus-themes
  (require 'modus-themes)

  (setopt modus-themes-custom-auto-relload nil
	  modus-themes-to-toggle '(modus-vivendi modus-operandi)
	  modus-themes-mixed-fonts t
	  modus-themes-italic-constructs t
	  modus-themes-bold-constructs t
	  modus-themes-completions '((t . (extrabold)))
	  modus-themes-prompts '(extrabold)
	  modus-themes-common-palette-overrides nil)
  (modus-themes-load-theme (car modus-themes-to-toggle)))
#+end_src

*** General

#+begin_src emacs-lisp :tangle "shl-modules/shl-appearance.el" :mkdirp yes
;; Line numbers
(setopt display-line-numbers-width 3
        display-line-numbers-type 'relative)
(add-hook 'org-mode-hook #'display-line-numbers-mode)
(add-hook 'prog-mode-hook #'display-line-numbers-mode)

;; Display fill-column
(when (boundp 'display-fill-column-indicator)
  (setq-default indicate-buffer-boundaries 'left
		fill-column 100
                display-fill-column-indicator-character ?┊)
  (add-hook 'prog-mode-hook #'display-fill-column-indicator-mode))

;; Speed up font rendering for special characters
;; @see https://www.reddit.com/r/emacs/comments/988paa/emacs_on_windows_seems_lagging/
(setq inhibit-compacting-font-caches t)

;; Modeline
(add-hook 'after-init-hook #'display-time-mode)
(add-hook 'after-init-hook #'display-battery-mode)

(provide 'shl-appearance)
#+end_src

** System Settings

*** Environment Variables

I use Purcell's ~exec-path-from-shell~ to ensure that Emacs follow the system configuration for my environment variables.

#+begin_src emacs-lisp :tangle "shl-modules/shl-essentials.el" :mkdirp yes
(shl-pkg-config 'exec-path-from-shell
  (when (or (memq window-system '(mac ns x pgtk))
            (unless (memq system-type '(ms-dos windows-nt))
              (daemonp)))
    (exec-path-from-shell-initialize)))
#+end_src

** Backups and Autosaves

Backups and autosaves are fine - but I do not want them to clutter up my systems.

#+begin_src emacs-lisp :tangle "shl-modules/shl-essentials.el" :mkdirp yes
(let ((backup-dir "~/.cache/tmp/emacs/backups")
      (auto-saves-dir "~/.cache/tmp/emacs/auto-saves/"))
  (dolist (dir (list backup-dir auto-saves-dir))
    (when (not (file-directory-p dir))
      (make-directory dir t)))
  (setq backup-directory-alist `(("." . ,backup-dir))
        auto-save-file-name-transforms `((".*" ,auto-saves-dir t))
        tramp-backup-directory-alist `((".*" . ,backup-dir))
        tramp-auto-save-directory auto-saves-dir))


(setopt backup-by-copying t    ; Don't delink hardlinks
	delete-old-versions t  ; Clean up the backups
	version-control t      ; Use version numbers on backups,
	kept-new-versions 5    ; keep some new versions
	kept-old-versions 2)   ; and some old ones, too
#+end_src

** General settings

#+begin_src emacs-lisp :tangle "shl-modules/shl-essentials.el" :mkdirp yes
;; Turn on savehist mode
(savehist-mode 1)

;; Settings
(setopt ring-bell-function 'ignore
	custom-file (concat user-emacs-directory "custom.el")
        bookmark-default-file (locate-user-emacs-file ".bookmarks.el")  ;; Hide bookmarks.el, to not clutter user-emacs-dir
        use-short-answers t  ;; Use y and n instead of yes and no.
	buffer-menu-max-size 30
        inhibit-splash-screen t
	case-fold-search t  ;; Ignore case while searching
	column-number-mode t  ;; Show column number in modeline
	indent-tabs-mode nil  ;; Ensure that all indentation is with spaces
	create-lockfiles nil  ;; Don't clutter directories with lock files
	save-interprogram-paste-before-kill t  ;; Save existing clipboard text into kill ring before replacing.
	scroll-preserve-screen-position 'always  ;; Ensure that scrolling does not move point
        truncate-lines nil ;; Truncate lines when wider than buffer-width
        truncate-partial-width-windows nil)
#+end_src

** User Experience

*** Minibuffer Completion

I use the ~vertico~, ~consult~, ~embark~ and ~marginalia~ stack.

#+begin_src emacs-lisp :tangle "shl-modules/shl-completion.el" :mkdirp yes
(shl-pkg-config 'vertico
  (setopt vertico-scroll-margin 0
	  vertico-count 5
	  vertico-resize t
	  vertico-cycle t)
  (vertico-mode))

(shl-pkg-config 'embark
  (global-set-key (kbd "C-.") 'embark-act)
  (global-set-key (kbd "M-.") 'embark-dwim))

(shl-pkg-config 'consult
  (global-set-key [remap switch-to-buffer] 'consult-buffer)
  (global-set-key [remap switch-to-buffer-other-window] 'consult-buffer-other-window)
  (global-set-key [remap switch-to-buffer-other-frame] 'consult-buffer-other-frame)
  (global-set-key [remap goto-line] 'consult-goto-line))

(shl-pkg-config 'embark-consult
  (with-eval-after-load 'embark
    (require 'embark-consult)
    (add-hook 'embark-collect-mode-hook 'embark-consult-preview-minor-mode)))

(shl-pkg-config 'marginalia
  (setopt marginalia-max-relative-age 0) ;; Use absolute time
  (marginalia-mode))

(shl-pkg-config 'orderless
  (setq completion-category-defaults nil
        completion-category-overrides '((eglot (styles orderless))
                                        (eglot-capf (styles orderless)))
        completion-cycle-threshold 4)

  (with-eval-after-load 'vertico
    (require 'orderless)
    (setq completion-styles '(orderless basic))))
#+end_src

*** Completion

#+begin_src emacs-lisp :tangle "shl-modules/shl-completion.el" :mkdirp yes
(shl-pkg-config 'corfu
  (add-hook 'after-init-hook #'global-corfu-mode)

  (setq global-corfu-modes '((not erc-mode
                                  circe-mode
                                  help-mode
                                  gud-mode
                                  eat-mode
                                  inferior-python-mode)
                             t))

  (setopt corfu-auto t
	  corfu-auto-delay 0.1
	  corfu-auto-prefix 1
	  corfu-cycle t
	  corfu-separator ?\s
	  corfu-preselect 'first
	  corfu-count 16
	  corfu-max-width 120
	  corfu-preview-current nil
	  corfu-on-exact-match nil
	  corfu-quit-at-boundary 'separator
	  corfu-quit-no-match 'separator)
  (setq text-mode-ispell-word-completion nil)

  (with-eval-after-load 'corfu
    (require 'corfu-history)
    (add-hook 'corfu-mode-hook 'corfu-history-mode)

    (with-eval-after-load 'savehist
      (add-to-list 'savehist-additional-variables 'corfu-history)))

  ;; Rebinding keys
  (with-eval-after-load 'corfu
    (shl-bind-key corfu-map
      "C-y" #'corfu-insert
      "RET" nil))

  

  ;; Popopinfo
  (with-eval-after-load 'corfu
    (require 'corfu-popupinfo)
    (add-hook 'corfu-mode-hook 'corfu-popupinfo-mode)
    (setq corfu-popupinfo-delay '(0.5 . 1.0))))

(provide 'shl-completion)
#+end_src


*** General Settings

#+begin_src emacs-lisp :tangle "shl-modules/shl-essentials.el" :mkdirp yes
;; Ensure that opening parentheses are paired with closing
(add-hook 'prog-mode-hook #'electric-pair-mode)
(add-hook 'prog-mode-hook #'electric-indent-mode)

;; Subword-mode enables moving in CamelCase and snake_case
(global-subword-mode)

;; Delete selection
(add-hook 'after-init-hook #'delete-selection-mode)

;; Expand Region makes for a nicer way to mark stuff
(shl-pkg-config 'expand-region
  (shl-bind-key global-map
    "M-h" #'er/expand-region))


;; Hippie Expand instead of dabbrev
(global-set-key [remap dabbre-expand] 'hippie-expand)

(provide 'shl-essentials)
#+end_src

*** Completion Buffer

#+begin_src emacs-lisp :tangle "shl-modules/shl-development.el" :mkdirp yes
(defun shl/colorize-compilation-buffer ()
  (read-only-mode 'toggle)
  (ansi-color-apply-on-region compilation-filter-start (point))
  (read-only-mode 'toggle))
(add-hook 'compilation-filter-hook 'shl/colorize-compilation-buffer)
#+end_src

*** Magit

#+begin_src emacs-lisp :tangle "shl-modules/shl-development.el" :mkdirp yes
(shl-pkg-config 'magit
  (global-set-key (kbd "C-x g") #'magit-status))
#+end_src

*** Eshell

#+begin_src emacs-lisp :tangle "shl-modules/shl-development.el" :mkdirp yes
(defun eshell-clear-buffer ()
  "Clear terminal"
  (interactive)
  (let ((inhibit-read-only t))
    (erase-buffer)
    (eshell-send-input)))

(add-hook 'eshell-mode-hook
          #'(lambda()
              (local-set-key (kbd "C-l") 'eshell-clear-buffer)))

(shl-pkg-config 'esh-autosuggest
  (add-hook 'eshell-mode-hook #'esh-autosuggest-mode))

(provide 'shl-development)
#+end_src


** Org Mode

#+begin_src emacs-lisp :tangle "shl-modules/shl-org.el" :mkdirp yes
(global-set-key (kbd "C-c l") #'org-store-link)
(global-set-key (kbd "C-c a") #'org-agenda)
(global-set-key (kbd "C-c c") #'org-capture)

(setopt org-directory (expand-file-name "~/data/org/"))
(setq org-confirm-babel-evaluate nil)
(setq org-src-window-setup 'current-window)
(setq org-edit-src-persistent-message nil)
(setq org-src-fontify-natively t)
(setq org-src-preserve-indentation t)
(setq org-src-tab-acts-natively t)
(setq org-edit-src-content-indentation 0)

(provide 'shl-org)
#+end_src
